run/NACA0017_AoA[-3-3]_k-omega (copy)/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forceCoeffs1
{
    type            forceCoeffs;

    libs            (forces);

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         (foil);
    rho             rhoInf;      // Indicates incompressible
    rhoInf          1;           // Required when rho = rhoInf
    liftDir         (0 1 0);
    dragDir         (1 0 0);
    CofR            (0 0 0);     // Centre of rotation for moment calculation
    pitchAxis       (0 0 1);     // Axis of roatation		
    magUInf         10;          // Freestream velocity - LINK IT TO SETTING VALUE
    lRef            1;           // Wheelbase length - LINK IT TO SETTING VALUE
    Aref            1;           // chord * Z direction - CHECK IT
}

// ************************************************************************* //
