run/NACA0017_AoA[-3-3]_k-omega (copy)/system/meshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile     "domain.fms";

maxCellSize     0.05;



objectRefinements
{
    	wake
        {
            cellSize 0.05;
            type box;
            centre (0 0 0);
            lengthX 3;
            lengthY 2;
            lengthZ 1;
        }
}

edgeMeshRefinement
{

}

localRefinement
{
	Foil
	{
		additionalRefinementLevels 5;
		refinementThickness 0.1; //cm
	}
}

boundaryLayers
{
	patchBoundaryLayers
	{
		Foil
		{
			nLayers 10;
			thicknessRatio 1.1;
			maxFirstLayerThickness 1;
			allowDiscontinuity 1;
		}
	}
}


// ************************************************************************* //